SE4Foam/tutorials/valids/laminar/fr/Re1e3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        /*type            fixedValue;
        value           uniform (0 8.53e-3 0);*/

        type            parabolicRadialVelocity4SEFoam;
        Vm              (8.53e-3);//Re=1e3
        R               0.05;
        longDir         (0 1 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    tubeWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
